package lesson2;

public class HomeWorkTest {
    public static void main(String[] args) {
        System.out.println("Ответ к Задаче 1: " + taskOne());
        System.out.println("Ответ к Задаче 2: " + taskTwo(3, 5));
    }
    //Задача №1
    //Произвести преобразование "234" в число типа int и прибавить к этому числу длину строки "some_text"

    static int taskOne() {
        String num = "234";
        String text = "some_text";
        int res = Integer.parseInt(num) + text.length();
        return res;
    }
    //Задача №2
    //Посчитать (a+b)^2 = ?, при a=3, b=5

    static int taskTwo(int a, int b) {
        return (int) Math.pow((a + b), 2);
    }

    /*
    // Задание №3:
        // Дано:
        boolean hasFuel = true;
        boolean hasElectricsProblem = false;
        boolean hasMotorProblem = false;
        boolean hasTransmissionProblem = true;
        boolean hasWheelsProblem = true;
        // В автосервис приехала сломанная машина. Механики находят неисправность следующим способом:
        // Если у машины нет бензина и ничего не сломано, то отдают машину владельцу и берут 1000 рублей за консультацию.
        // Если у машины проблема с двигателем, то чинят и берут 10 000.
        // Если у машины проблема с электрикой, то чинят и берут 5000.
        // Если у машины проблема с коробкой передач, то чинят и берут 4000.
        // Если у машины проблема с колесами, то чинят и берут 2000.
        // Если две детали сломаны, то на общий счет идет скидка 10%.
        // Если сломана коробка передач, и электрика или двигатель, то на общий счет скидка 20%.
        // Если нет бензина и что-то сломано, то за консультацию денег не берут.
        // Ситуации, что бензин есть и ничего не сломано - быть не может.
        // Ожидаемый результат: выведен на экран счет клиенту.
     */


}
